app/controllers/user_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`fb_id` = '100000266643253' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `fb_id`, `image`, `name`, `updated_at`) VALUES ('2014-01-19 07:56:25', 'xtony77@yahoo.com.tw', '100000266643253', 'http://graph.facebook.com/100000266643253/picture', 'Jhih-Ya Chen', '2014-01-19 07:56:25')
---
	def login
		auth_hash = request.env['omniauth.auth']
        if auth_hash
        	fb_id = auth_hash['uid']
        	fb_name = auth_hash['info']['name']
        	fb_email = auth_hash['info']['email']
        	fb_image = auth_hash['info']['image']

        	data_chk = User.where(:fb_id => fb_id).first

            if data_chk
            	data_chk.update_attributes(:fb_id => fb_id, :name => fb_name, :email => fb_email, :image => fb_image)
	        else
	        	 @user = User.new(
	            				:fb_id => fb_id,
	                            :name  => fb_name,
	                            :email => fb_email,
	                            :image => fb_image
	                        )
	            @user.save